# ruby ~/Development/wordtools/src/words/prep-multiwords.rb < multiwords.txt

# first: get all non-ASCII letters

# odds = ''
# ARGF.each_line do |line|
#   odd = line.gsub(/[- 'a-z]+/i, '')
#   odds += odd unless odd.empty?
# end
# puts odds.split('').sort.uniq.join('')

# !"&()*+,./:;?@`°·¼ÁÅÆÉÎÓÖØÚÜßàáâãäåæçèéêëìíîïðñòóôõöøúûüýāăąćČčĐđėęěğĩīıŁłńňŌōőœřŚŠšũūŭůųŷźŻżŽžơưǃǝǫȘșțɁʔʟʻʼʽ̨̠̱́̍̓ΩαβγδθμπσψḥṇṚṢṳẒẕạảẤấầậắằẵếềệịọốồộớờụủừỳỵ–—‘’“”…′₂ℝ☕♭ⱡいなꞌ𝐑🧢

replacements = {
  ' ' => ' ',
  '-' => ' ',
  '–' => ' ',
  '—' => ' ',
  '+' => '',
  '`' => '',
  '(' => '',
  ')' => '',
  '!' => '',
  ';' => '',
  ':' => '',
  '?' => '',
  ',' => '',
  '.' => '',
  '"' => '',
  "'" => '',
  '‘' => '',
  '’' => '',
  '“' => '',
  '”' => '',
  '…' => '',
  '′' => '',
  'ʻ' => '',
  'ʼ' => '',
  '/' => '',
  '°' => 'degrees',
  '@' => 'at',
  '&' => 'and',
  '¼' => 'quarter',
  'Á' => 'A',
  'Å' => 'A', 
  'Æ' => 'AE',
  'É' => 'E', 
  'Î' => 'I',
  'Ó' => 'O',
  'Ö' => 'O',
  'Ø' => 'O',
  'Ú' => 'U',
  'Ü' => 'U',
  'ß' => 'ss',
  'à' => 'a',
  'á' => 'a',
  'â' => 'a',
  'ã' => 'a',
  'ä' => 'a',
  'å' => 'a',
  'æ' => 'ae',
  'ç' => 'c',
  'è' => 'e',
  'é' => 'e',
  'ê' => 'e',
  'ë' => 'e',
  'ì' => 'i',
  'í' => 'i',
  'î' => 'i', 
  'ï' => 'i',
  'ð' => 'th',
  'ñ' => 'n',
  'ò' => 'o',
  'ó' => 'o',
  'ô' => 'o',
  'o' => 'õ',
  'ö' => 'o',
  'ø' => 'o',
  'ú' => 'u',
  'û' => 'u',
  'ü' => 'u',
  'ý' => 'y',
  'ā' => 'a',
  'ă' => 'a',
  'ą' => 'a', 
  'ć' => 'c',
  'Č' => 'C',
  'č' => 'c',
  'Đ' => 'D',
  'đ' => 'd', 
  'ė' => 'e',
  'ę' => 'e',
  'ě' => 'e',
  'ğ' => 'g',
  'ĩ' => 'i',
  'ī' => 'i',
  'ı' => 'i',
  'Ł' => 'L',
  'ł' => 'l',
  'ń' => 'n',
  'ň' => 'n',
  'Ō' => 'O',
  'ō' => 'o',
  'ő' => 'o',
  'œ' => 'oe',
  'ř' => 'r',
  'Ś' => 'S',
  'Š' => 'S',
  'š' => 's',
  'ũ' => 'u',
  'ū' => 'u',
  'ŭ' => 'u',
  'ů' => 'u',
  'ų' => 'u',
  'ŷ' => 'y',
  'ź' => 'z', 
  'Ż' => 'Z',
  'ż' => 'z',
  'Ž' => 'Z',
  'ž' => 'z',
  'ơ' => 'o',
  'ư' => 'u',
  'ǝ' => 'e',
  'ǫ' => 'o',
  'Ș' => 'S',
  'ș' => 's',
  'ț' => 't',
  'ʟ' => 'L',
  'Ω' => 'O',
  'α' => 'alpha',
  'β' => 'beta',
  'γ' => 'gamma',
  'δ' => 'delta',
  'θ' => 'theta',
  'μ' => 'mu',
  'π' => 'pi',
  'σ' => 'sigma',
  'ψ' => 'psi',
  'ḥ' => 'h',
  'ṇ' => 'n',
  'Ṛ' => 'R',
  'Ṣ' => 'S',
  'ṳ' => 'u',
  'Ẓ' => 'Z',
  'ẕ' => 'z',
  'ạ' => 'a',
  'ả' => 'a',
  'Ấ' => 'A',
  'ấ' => 'a',
  'ầ' => 'a',
  'ậ' => 'a',
  'ắ' => 'a',
  'ằ' => 'a',
  'ẵ' => 'a',
  'ế' => 'e',
  'ề' => 'e',
  'ệ' => 'e',
  'ị' => 'i',
  'ọ' => 'o',
  'ố' => 'o',
  'ồ' => 'o',
  'ộ' => 'o',
  'ớ' => 'o',
  'ờ' => 'o',
  'ụ' => 'u',
  'ủ' => 'u',
  'ừ' => 'u',
  'ỳ' => 'y',
  'ỵ' => 'y',
  'ℝ' => 'R',
  '𝐑' => 'R',
}

pairs = ARGF.each_line.map do |line|
  line.strip!
  [line.gsub(/[^a-z]+/i) { |c| replacements[c] || c }.downcase.strip, line]
end

pairs = pairs.filter { |(subbed, line)| !line.match(/^-/) && !subbed.empty? && subbed.match?(/^[a-z ]+$/) }

pairs = pairs.sort { |a, b| a[0] <=> b[0] }.uniq { |(subbed, line)| subbed }

require 'json'
weights = JSON.load_file('/Users/george/Development/wordtools/docs/words.json')

pairs = pairs.map { |(subbed, line)|
  words = subbed.split(' ').filter { |word| !word.empty? }
  weight = words.reduce(0.0) { |memo, word| memo + (weights[word] || 0.5).to_f } / words.length.to_f
  [subbed.gsub(' ', ''), line, weight]
}.sort { |a, b| b[2] - a[2] }

result = pairs.reduce({}) do |memo, (subbed, line, weight)|
  memo[subbed] = [line, weight.round(2)]
  memo
end
puts JSON.generate(result, object_nl: "\n")
